buttons = {
    "main_menu": [
        ["IEEE"],
        ["رویدادها 🗓️", "عضویت در IEEE 📝"],
        ["دانشجو راهنما 📚", "ارتباط با اعضا 📞"],
        ["انتقادات و پیشنهادات 💬"],
        ["درباره بات 🤖"]
    ],
    "events_menu": [
        ["رویداد های جاری 🔄", "رویداد های برگزار شده 📅"],
        ["بازگشت 🔙"]
    ],
    "guide_menu": [
        ["آموزش پرتال 📖"],
        ["چارت درسی 🗂️", "آخرین تقویم آموزشی 📆"],
        ["نقشه دانشگاه 🏫", "نقشه دانشکده 🧭"],
        ["کانال های مهم دانشگاه 🔗"],
        ["بازگشت 🔙"]
    ],
    "portal_menu": [
        ["آموزشی 📚", "پژوهشی 🔬"],
        ["دانشجویی 🧑‍🎓", "مالی و پشتیبانی 💵"],
        ["سایر موارد 🌐"],
        ["↩️"]
    ],
    "cancel_menu": [
        ["Cancel"]
    ]
}

messages = {
  "start": "به بات شاخه IEEE خوش آمدید🤖\n\nبرای استفاده از بات بر روی گزینه مورد نظر خود در قسمت کیبورد کلیک کنید.\n\nدر صورت بروز مشکل به آیدی @ieeefumsb_admin پیغام دهید.",
  "ieee": "IEEE 🌐 (Institute of Electrical and Electronics Engineers)\nبزرگ‌ترین سازمان حرفه‌ای در جهان است که به توسعه فناوری‌های نوین در زمینه‌های برق ⚡️، الکترونیک 💡، کامپیوتر و علوم مرتبط اختصاص دارد. این سازمان در سال ۱۹۶۳ میلادی تأسیس شد و با داشتن بیش از ۴۰۰ هزار عضو در سراسر دنیا 🌍، نقشی برجسته در گسترش دانش و تحقیقات علمی ایفا می‌کند. IEEE با ارائه کنفرانس‌ها 🎤، مجلات علمی 📚 و استانداردهای صنعتی 🔧، به ترویج دانش و ارتباط میان متخصصان این حوزه کمک می‌کند و شبکه‌ای جهانی از نوآوران و متخصصان ایجاد کرده است.\n\nیکی از بخش‌های کلیدی این سازمان، شاخه‌های دانشجویی IEEE هستند 🎓. شاخه‌های دانشجویی، فرصتی بی‌نظیر برای دانشجویان در دانشگاه‌های مختلف فراهم می‌کنند تا در پروژه‌های تحقیقاتی، کارگاه‌های آموزشی 🛠️، و برنامه‌های کارآفرینی 💼 شرکت کنند و با اساتید و حرفه‌ای‌های این حوزه در ارتباط باشند. این شاخه‌ها بستری برای ارتقاء دانش علمی و مهارت‌های حرفه‌ای دانشجویان فراهم کرده و فرصت‌هایی برای انجام پروژه‌های تحقیقاتی، رقابت‌های علمی 🏆 و همکاری‌های نوآورانه ایجاد می‌کنند.\n\nشاخه IEEE دانشگاه فردوسی مشهد، با بیش از یک دهه فعالیت پویا و خلاقانه، به یکی از شاخه‌های پیشرو در ایران 🇮🇷 تبدیل شده است. این شاخه با برگزاری دوره‌های آموزشی 📖، کنفرانس‌ها 📅 و جلسات علمی، به دانشجویان کمک می‌کند تا با آخرین پیشرفت‌های فناوری آشنا شوند. در این ویدیو 🎥، توضیحات مختصری ارائه شده است.\n\nشاخه دانشجویی IEEE دانشگاه فردوسی مشهد همواره پذیرای دانشجویان پرانگیزه و مشتاق ❤️ است و با افتخار آماده همکاری در زمینه‌های مختلف علمی و پژوهشی است 🌱.",
  "events": "در این بخش شما میتوانید به آرشیو رویدادهای برگزار دسترسی پیدا کنید و یا از اخرین رویداد ها مطلع شوید🔔\n\nگزینه مورد نظر خود را انتخاب کنید:",
  "join_ieee": "اگر تمایل به عضویت در شاخه IEEE و فعالیت در آن دارید، لطفاً فرم گوگل زیر را تکمیل کنید 📋👇\nhttps://forms.gle/N5PLTBqVivZMrykM6\n\nدر صورت داشتن هرگونه سوال درباره عضویت، می‌توانید به آیدی تلگرام @iliya_abd پیام دهید.",
  "guide_student": "هر ساله شاخه IEEE با هدف بهتر آشنا شدن دانشجویان نو ورود با فرآیند تحصیلی برنامه‌ی تحت عنوان دانشجو راهنما برگزار میکند 📚\nدر این بخش میتوانید به محتوای این برنامه دسترسی پیدا کنید.",
  "contact_members": "برای همکاری و ارتباط بیشتر با اعضای شاخه IEEE دانشگاه فردوسی مشهد، می‌توانید به آیدی‌های زیر پیام دهید و با مسئولین شاخه در تماس باشید:\n\n🔹 اکانت رسمی شاخه: @ieeefumsb_admin\n🔹 رییس شاخه: @Ali_Navaiy 👨‍💼\n🔹 نایب رییس شاخه: @wall_rick\n🔹 دبیر شاخه: @iliya_abd\n🔹 مسئول ارتباط با صنعت: @Aida_zamani126 🔗\n🔹 مسئول روابط عمومی: @Yasna_Pymnia 📢\n🔹 مسئول آموزشی: @Arn989 📚\n\nما با افتخار آماده همکاری و پاسخگویی به دانشجویان هستیم 🌟.",
  "completed_events": "به زودی تکمیل می‌شود ⏳",
  "current_events": "به زودی تکمیل می‌شود ⏳",
  "other_cases": "به زودی تکمیل می‌شود ⏳",
  "about_bot": "این بات توسط @HESOYAM_abuser 👨‍💻 ساخته شده و هدف آن فراهم کردن دسترسی آسان به منابع، رویدادها و اطلاعات مرتبط با IEEE برای دانشجویان و اعضا است. 🤖\n\nاین بات به گونه‌ای طراحی شده تا همراه مفیدی برای کاربرانی باشد که به دنبال فرصت‌های همکاری، راهنمایی 🎓 و ارائه بازخورد 📬 هستند.\n\nاین پروژه به صورت متن‌باز است و از مشارکت‌های شما استقبال می‌شود! 🌐\n\nاگر تمایل به مشارکت یا بررسی کد بات دارید، به مخزن پروژه در https://github.com/HESOYAM-abuser/IEEEbot سر بزنید.\n\nچه پیشنهاد بهبود، افزودن قابلیت‌های جدید، یا رفع باگ‌ها 🐛 باشد، نظر شما در بهتر کردن این بات برای همه ارزشمند است. 💡",
  "suggestion":"لطفا پیشنهادات، انتقادات و نظرات خود را با ما در قالب متن در میان بگذارید.\nپیام ها به صورت ناشناس ارسال میشوند در صورت تمایل، مشخصات خود را نیز وارد کنید",
  "suggestion_received": "با تشکر از همکاری شما \nمطلب ارسالی شما توسط تیم شاخه بررسی خواهد شد. 🙏",
  "suggestion_cancelled": "لغو شد.",
  "new_suggestion":"(NEW SUGGESTION):\n\n",
  "choose_portal_option": "گزینه مورد نظر خود را انتخاب کنید.",
  "important_channels":"با کلیک کردن بر روی لینک زیر میتوانید به آرشیو کانال های دانشگاه دسترسی پیدا کنید:\nhttps://t.me/addlist/fyRUAaelItZmY2Vk",
}


captions = {
    "class_schedule": "برنامه کلاسی 🗓️, حذف و اضافه ➖➕, دروس ارائه شده ترم 📘, حضور و غیاب 👥",
    "exam_schedule": "برنامه امتحانی 📝, اطلاعیه نمرات 🏆, تاییدیه ✅",
    "teacher_evaluation": "ارزشیابی اساتید 👩‍🏫",
    "book_loan": "امانت و تمدید و رزرو 📚🔄",
    "meal_reservation": "امور تغذیه 🍽️",
    "sports_services": "خدمات ورزشی 🏅",
    "online_payment": "نحوه پرداخت الکترونیکی 💳",
    "portal_password": "رمز اینترنت و پرتال 🔐"
}

urls = {
    "root": {
        "calendar": "https://cnuh.storage.iran.liara.space/ieee-bot/calendar.jpg",
        "course_chart": "https://cnuh.storage.iran.liara.space/ieee-bot/course_chart.pdf",
        "faculty_map": "https://cnuh.storage.iran.liara.space/ieee-bot/faculty_map.pdf",
        "introduction_video": "https://cnuh.storage.iran.liara.space/ieee-bot/introduction_video.mp4",
        "university_map": "https://cnuh.storage.iran.liara.space/ieee-bot/university_map.jpg"
    },
    "portal": {
        "educational": {
            "class_schedule": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/educational/class_schedule.mp4",
            "educational_requests": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/educational/educational_requests_1.mp4",
            "exam_schedule": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/educational/exam_schedule.mp4",
            "teacher_evaluation": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/educational/teacher_evaluation.mp4"
        },
        "financial_support": {
            "online_payment": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/financial_support/online_payment.mp4",
            "portal_password": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/financial_support/portal_password.mp4"
        },
        "research": {
            "book_loan": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/research/book_loan.mp4"
        },
        "student_affairs": {
            "meal_reservation": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/student_affairs/meal_reservation.mp4",
            "sports_services": "https://cnuh.storage.iran.liara.space/ieee-bot/portal/student_affairs/sports_services.mp4"
        }
    }
}
